sql/active_record/URLShortener/app/models/shortened_url.rb

  def self.random_code
    random_code = SecureRandom.urlsafe_base64
    ShortenedUrl.exists?(short_url: random_code) ? ShortenedUrl.random_code : random_code
---
SELECT 1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "yp6D8tGxj03gXkIwo6pFQw"], ["LIMIT", 1]]

  def self.make_shortened_url(user, long_url)
    ShortenedUrl.create!(short_url: self.random_code, long_url: long_url, user_id: user.id)
---
INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"