sql/active_record/URLShortener/app/models/visit.rb

INSERT INTO "visits" ("short_url_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["short_url_id", 8], ["user_id", 6], ["created_at", "2020-01-08 04:13:02.430526"], ["updated_at", "2020-01-08 04:13:02.430526"]]
---
  def self.record_visit!(user, shortened_url)
    Visit.create!(short_url_id: shortened_url.id, user_id: user.id)